/*
 * $Id$
 * 
 * 各機器の制御を簡単にするためのラッパー関数群
 */

// ----------------------------------------------------------------------
// シリアルデバッグのレベル
#define DEBUGLEVEL 10

// ----------------------------------------------------------------------
// センサ感知の状態
//   0: Low active
//   1: High active
#define DETECT 1

// ----------------------------------------------------------------------
// 3色LEDの色の定義
enum ledcolor {
  LED_BLACK,
  LED_RED,
  LED_GREEN,
  LED_BLUE,
  LED_YELLOW,
  LED_CYAN,
  LED_MAGENTA,
  LED_WHITE,
};

// ----------------------------------------------------------------------
// モータの回転方向
enum motordir {
  CW,
  CCW,
};

// ----------------------------------------------------------------------
// メカナムホイールの進行方向
enum mechanumdir {
  MECH_STOP, // 停止
  MECH_FW, // 前進
  MECH_BW, // 後退
  MECH_LL, // 左行き
  MECH_RR, // 右行き
  MECH_TL, // 左旋回
  MECH_TR, // 右旋回
  MECH_FL, // 左斜め前
  MECH_FR, // 右斜め前
  MECH_BL, // 左斜め後ろ
  MECH_BR, // 右斜め後ろ
};

// ----------------------------------------------------------------------
// LED初期化関数
void initLED();

// ----------------------------------------------------------------------
// LED点灯関数
void LED(int, enum ledcolor);

// ----------------------------------------------------------------------
// センサ初期化関数
void initSensor();

// ----------------------------------------------------------------------
// モータ初期化関数
void initMotor();

// ----------------------------------------------------------------------
// モータ駆動関数（PWM出力）
void analogOut(int, int, int);

// ----------------------------------------------------------------------
// モータ駆動関数（ON/OFF出力）
void digitalOut(int, int);

// ----------------------------------------------------------------------
// メカナムホイール駆動関数
void mechanum(enum mechanumdir, uint8_t);

// ----------------------------------------------------------------------
// センサ1-9読み込み関数
uint16_t readSensorW();

// ----------------------------------------------------------------------
// ラインセンサ読み込み関数
uint8_t readSensorL();
